In [1]:
import pandas as pd
data = pd.read_csv('Analytics.csv')

In [2]:
data.head()

                    ts user_id country_id site_id
0  2019-02-01 00:01:24  LC36FC        TL6   N0OTG
1  2019-02-01 00:10:19  LC39B6        TL6   N0OTG
2  2019-02-01 00:21:50  LC3500        TL6   N0OTG
3  2019-02-01 00:22:50  LC374F        TL6   N0OTG
4  2019-02-01 00:23:44  LCC1C3        TL6   QGO3G

## Q1

In [3]:
#Consider only the rows with country_id = "BDV" (there are 844 such rows). For each site_id, 
#we can compute the number of unique user_id's found in these 844 rows. 
#Which site_id has the largest number of unique users? And what's the number?

BDV = data[data['country_id'] == 'BDV']
BDV.head(5)

                     ts user_id country_id site_id
13  2019-02-01 00:47:58  LC3C22        BDV   N0OTG
32  2019-02-01 02:46:15  LC375A        BDV   5NPAU
87  2019-02-01 06:44:42  LC392E        BDV   N0OTG
88  2019-02-01 07:36:56  LC3FAE        BDV   5NPAU
94  2019-02-01 08:58:35  LC3AFF        BDV   3POLC

In [4]:
GB = BDV[['ts','user_id', 'country_id', 'site_id']].groupby(['site_id']).agg({'user_id': pd.Series.nunique})
GB

         user_id
site_id
3POLC          2
5NPAU        544
N0OTG         90

In [5]:
GB_t = GB.loc[GB['user_id'] == GB.max()['user_id']]
GB_t

         user_id
site_id
5NPAU        544

## Q2

In [6]:
#Between 2019-02-03 00:00:00 and 2019-02-04 23:59:59, there are four users who visited a certain site 
#more than 10 times. Find these four users & which sites they (each) visited more than 10 times. 
#(Simply provides four triples in the form (user_id, site_id, number of visits) in the box below.)

Time = data[(data['ts'] < '2019-02-04 23:59:59') & (data['ts'] > '2019-02-03 00:00:00')]
Time.shape

(1031, 4)

In [7]:
import numpy as np

In [8]:
User = Time[['user_id','site_id']].groupby(['user_id', 'site_id'])

In [9]:
u = User['site_id'].count().reset_index(name='Size')

In [10]:
table = u.loc[u['Size'] > 10]
table

    user_id site_id  Size
3    LC06C3   N0OTG    25
417  LC3A59   N0OTG    26
485  LC3C7E   3POLC    15
493  LC3C9D   N0OTG    17

## Q3

In [11]:
#For each site, compute the unique number of users whose last visit (found in the original data set) was to that site.
#For instance, user "LC3561"'s last visit is to "N0OTG" based on timestamp data. 
#Based on this measure, what are top three sites? 
#(hint: site "3POLC" is ranked at 5th with 28 users whose last visit in the data set was to 3POLC; 
#simply provide three pairs in the form (site_id, number of users).)

In [12]:
Last = data.sort_values(by=['ts']).drop_duplicates(subset='user_id', keep='last')

In [13]:
LL = Last.groupby(['site_id'])['site_id'].count().reset_index(name='Size')

In [14]:
Result = LL.sort_values(by=['Size'], ascending=False).head(3)
Result

  site_id  Size
1   5NPAU   992
5   N0OTG   561
6   QGO3G   289

## Q4

In [15]:
#For each user, determine the first site he/she visited and the last site he/she visited based on the timestamp data. 
#Compute the number of users whose first/last visits are to the same website. What is the number?

First = data.sort_values(by=['ts']).drop_duplicates(subset='user_id', keep='first')

In [16]:
Fs = First.sort_values(by=['user_id'])
Fs.shape

(1916, 4)

In [17]:
Ls = Last.sort_values(by=['user_id'])
Fs.shape

(1916, 4)

In [18]:
Fs.head(5)

                       ts user_id country_id site_id
1422  2019-02-03 18:52:50  LC00C3        QLT   5NPAU
1767  2019-02-04 11:35:10  LC01C3        QLT   5NPAU
733   2019-02-02 14:14:44  LC05C3        BDV   5NPAU
526   2019-02-01 22:49:39  LC06C3        TL6   N0OTG
2402  2019-02-05 19:06:42  LC07C3        BDV   5NPAU

In [19]:
Ls.head(5)

                       ts user_id country_id site_id
1422  2019-02-03 18:52:50  LC00C3        QLT   5NPAU
1767  2019-02-04 11:35:10  LC01C3        QLT   5NPAU
733   2019-02-02 14:14:44  LC05C3        BDV   5NPAU
3078  2019-02-07 01:16:12  LC06C3        TL6   N0OTG
2402  2019-02-05 19:06:42  LC07C3        BDV   5NPAU

In [20]:
df = pd.merge(Fs, Ls, how='left', on='user_id')
df.head(5)

,ts_x,user_id,country_id_x,site_id_x,ts_y,country_id_y,site_id_y
0,2019-02-03 18:52:50,LC00C3,QLT,5NPAU,2019-02-03 18:52:50,QLT,5NPAU
1,2019-02-04 11:35:10,LC01C3,QLT,5NPAU,2019-02-04 11:35:10,QLT,5NPAU
2,2019-02-02 14:14:44,LC05C3,BDV,5NPAU,2019-02-02 14:14:44,BDV,5NPAU
3,2019-02-01 22:49:39,LC06C3,TL6,N0OTG,2019-02-07 01:16:12,TL6,N0OTG
4,2019-02-05 19:06:42,LC07C3,BDV,5NPAU,2019-02-05 19:06:42,BDV,5NPAU

In [21]:
Same = df.loc[df['site_id_x'] == df['site_id_y']]

In [22]:
Same.head(5)

,ts_x,user_id,country_id_x,site_id_x,ts_y,country_id_y,site_id_y
0,2019-02-03 18:52:50,LC00C3,QLT,5NPAU,2019-02-03 18:52:50,QLT,5NPAU
1,2019-02-04 11:35:10,LC01C3,QLT,5NPAU,2019-02-04 11:35:10,QLT,5NPAU
2,2019-02-02 14:14:44,LC05C3,BDV,5NPAU,2019-02-02 14:14:44,BDV,5NPAU
3,2019-02-01 22:49:39,LC06C3,TL6,N0OTG,2019-02-07 01:16:12,TL6,N0OTG
4,2019-02-05 19:06:42,LC07C3,BDV,5NPAU,2019-02-05 19:06:42,BDV,5NPAU

In [23]:
Same.shape[0]

1670